Tekla.Structures.Drawing.UI.Events.Register
Registers the instance to listen to the speficied events.
Throws System.InvalidOperationException: Thrown if attempting registration when already registered.